{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Homework0.ipynb","provenance":[],"collapsed_sections":[],"authorship_tag":"ABX9TyMUIeE8WT5305vSeYxMf0up"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"bU97gG2IXqEC","colab_type":"text"},"source":["# Задачи 3-7, 13. Все по 2 балла"]},{"cell_type":"markdown","metadata":{"id":"E7Y4GQZnXri_","colab_type":"text"},"source":["Возьмите список, скажем, например, этот:\n","\n","a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89] и напишите программу, которая распечатывает все элементы списка, которые меньше 5."]},{"cell_type":"code","metadata":{"id":"Ql8fXFrYXvB7","colab_type":"code","colab":{"base_uri":"https://localhost:8080/","height":87},"outputId":"fa07cfb4-8510-4105-f448-839c0282164f","executionInfo":{"status":"ok","timestamp":1590771539355,"user_tz":-180,"elapsed":1464,"user":{"displayName":"Alisher Kenesbekov","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GgqWG4SUc7yYFw7j4FOi6DfdytLsV_TpwmgYsiW6g=s64","userId":"12173802242889154967"}}},"source":["a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]\n","for i in a: \n","    if int(i) < 5:\n","      print(i)"],"execution_count":1,"outputs":[{"output_type":"stream","text":["1\n","1\n","2\n","3\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"mnhHv4FPX2Da","colab_type":"text"},"source":["Создайте программу, которая запрашивает у пользователя число, а затем распечатывает список всех делителей этого числа. (Если вы не знаете, что такое делитель , это число, которое делится равномерно на другое число. Например, 13 - это делитель числа 26, потому что 26/13 не имеет остатка.)"]},{"cell_type":"code","metadata":{"id":"fdKOTniJX3GI","colab_type":"code","colab":{"base_uri":"https://localhost:8080/","height":105},"outputId":"4de7f646-bdae-4c12-9922-f44eb8eb65a2","executionInfo":{"status":"ok","timestamp":1590771581896,"user_tz":-180,"elapsed":26229,"user":{"displayName":"Alisher Kenesbekov","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GgqWG4SUc7yYFw7j4FOi6DfdytLsV_TpwmgYsiW6g=s64","userId":"12173802242889154967"}}},"source":["a = int(input(\"Ваше число:\"))\n","for i in range(a + 1):\n","    if(i != 0):\n","        if(a % i == 0):\n","            print(i)"],"execution_count":2,"outputs":[{"output_type":"stream","text":["Ваше число:3649\n","1\n","41\n","89\n","3649\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"SKxnl3hZYCkp","colab_type":"text"},"source":["Возьмите два списка, скажем, например, эти два:\n","\n","a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89] b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13] и написать программу, которая возвращает список, который содержит только элементы, общие для списков (без дубликатов). Убедитесь, что ваша программа работает с двумя списками разных размеров."]},{"cell_type":"code","metadata":{"id":"UH_09jRGYCTv","colab_type":"code","colab":{"base_uri":"https://localhost:8080/","height":34},"outputId":"b0ddf914-888c-4321-aec9-5ff6999fa2cb","executionInfo":{"status":"ok","timestamp":1590771618613,"user_tz":-180,"elapsed":1349,"user":{"displayName":"Alisher Kenesbekov","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GgqWG4SUc7yYFw7j4FOi6DfdytLsV_TpwmgYsiW6g=s64","userId":"12173802242889154967"}}},"source":["a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89] \n","b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]\n","l = []\n","for i in a:\n","    for j in b:\n","        if(i == j):\n","            l.append(i)\n","print(set(l))"],"execution_count":3,"outputs":[{"output_type":"stream","text":["{1, 2, 3, 5, 8, 13}\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"Yu0_3zcuYLh2","colab_type":"text"},"source":["Попросите пользователя ввести строку и распечатайте, является ли эта строка палиндромом или нет. ( Палиндром - это строка, которая читает одно и то же вперед и назад.)"]},{"cell_type":"code","metadata":{"id":"9VSe48_aYLG6","colab_type":"code","colab":{"base_uri":"https://localhost:8080/","height":52},"outputId":"1f5ca423-0914-4eb6-bcad-c25158f31286","executionInfo":{"status":"ok","timestamp":1590771670084,"user_tz":-180,"elapsed":24520,"user":{"displayName":"Alisher Kenesbekov","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GgqWG4SUc7yYFw7j4FOi6DfdytLsV_TpwmgYsiW6g=s64","userId":"12173802242889154967"}}},"source":["s = input()\n","flag = 0\n","for i in range(len(s)//2):\n","    if s[i] != s[-1-i]:\n","        print(\"It's not palindrome\")\n","        flag = 1\n","        break\n","if flag != 1:\n","    print(\"It's palindrome\")"],"execution_count":4,"outputs":[{"output_type":"stream","text":["123454321\n","It's palindrome\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"hNU_Ue08YYOm","colab_type":"text"},"source":["Скажем , я дам вам список , сохраненный в переменной: a = [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]. Напишите одну строку Python, которая берет этот список aи создает новый список, в котором есть только четные элементы этого списка"]},{"cell_type":"code","metadata":{"id":"tkIRYUJSYZEX","colab_type":"code","colab":{"base_uri":"https://localhost:8080/","height":34},"outputId":"ce05e8da-c7fc-4af6-845a-11f8d702cd35","executionInfo":{"status":"ok","timestamp":1590771694951,"user_tz":-180,"elapsed":1286,"user":{"displayName":"Alisher Kenesbekov","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GgqWG4SUc7yYFw7j4FOi6DfdytLsV_TpwmgYsiW6g=s64","userId":"12173802242889154967"}}},"source":["a = [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]\n","b = []\n","for i in a:\n","    if i % 2 == 0:\n","        b.append(i)\n","b"],"execution_count":5,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[4, 16, 36, 64, 100]"]},"metadata":{"tags":[]},"execution_count":5}]},{"cell_type":"markdown","metadata":{"id":"WmR9gnjYYckx","colab_type":"text"},"source":["Напишите программу, которая спрашивает пользователя, сколько чисел Фибоначчи генерировать, а затем генерирует их. Воспользуйтесь этой возможностью, чтобы подумать о том, как вы можете использовать функции. Обязательно попросите пользователя ввести число чисел в последовательности для генерации. ( Подсказка: последовательность Фибоначчи - это последовательность чисел, где следующее число в последовательности является суммой двух предыдущих чисел в последовательности. Последовательность выглядит так: 1, 1, 2, 3, 5, 8, 13,… )"]},{"cell_type":"code","metadata":{"id":"b1qdGhJvYe4L","colab_type":"code","colab":{"base_uri":"https://localhost:8080/","height":52},"outputId":"efa5e85a-5123-48b7-86ec-dab9a7838eee","executionInfo":{"status":"ok","timestamp":1590771774953,"user_tz":-180,"elapsed":5228,"user":{"displayName":"Alisher Kenesbekov","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GgqWG4SUc7yYFw7j4FOi6DfdytLsV_TpwmgYsiW6g=s64","userId":"12173802242889154967"}}},"source":["fib1 = fib2 = 1\n","n = int(input())\n","l = []\n","if n < 1:\n","    quit()\n","if n == 1:\n","    print(fib1, end=' ')\n","    quit()\n","l.append(fib1)\n","l.append(fib2)\n","for i in range(2, n):\n","    fib1, fib2 = fib2, fib1 + fib2\n","    l.append(fib2)\n"," \n","print(l)"],"execution_count":7,"outputs":[{"output_type":"stream","text":["20\n","[1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765]\n"],"name":"stdout"}]}]}